In [2]:
# 필요한 데이터를 받는 과정
# https://github.com/billyrohh/instacart_dataset
# sudo service mysql start
# ~/workspace$ git clone https://github.com/billyrohh/instacart_dataset
# cd instacart_dataset/

In [7]:
import pandas as pd
import os,glob

In [8]:
pwd

'/home/jotaesik/workspace'

In [16]:
for file in glob.glob("./instacart_dataset/*.csv"):
    locals()[file.split("/")[-1].split(".")[0]] = pd.read_csv(file)
    print(file)

./instacart_dataset/aisles.csv
./instacart_dataset/departments.csv
./instacart_dataset/products.csv
./instacart_dataset/orders.csv
./instacart_dataset/order_products__prior.csv

In [23]:
pip install sqlalchemy

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: sqlalchemy in /home/jotaesik/.local/lib/python3.10/site-packages (2.0.29)
Requirement already satisfied: greenlet!=0.4.17 in /home/jotaesik/.local/lib/python3.10/site-packages (from sqlalchemy) (3.0.3)
Requirement already satisfied: typing-extensions>=4.6.0 in /home/jotaesik/.local/lib/python3.10/site-packages (from sqlalchemy) (4.10.0)
Note: you may need to restart the kernel to use updated packages.

In [44]:
from sqlalchemy import create_engine, MetaData, Table, Column, Integer, String, BigInteger, DateTime, Date

In [46]:
import sqlalchemy
from urllib import parse
user = 'id'
password = 'pw'
host='localhost'
port = port
database = 'db'
password = parse.quote_plus(password)
engine = sqlalchemy.create_engine(f"mysql://{user}:{password}@{host}:{port}/{database}")

In [48]:
aisles.head(2)

   aisle_id                  aisle
0         1  prepared soups salads
1         2      specialty cheeses

In [49]:
metadata = MetaData()
#databricks를 쓴다면 spark를 쓸확률이 높다
# r"주소" ->raw값 그대로 읽어라

In [51]:
Table("aisles", metadata, 
      Column('aisle_id', Integer),
      Column("aisle", String(100)),
     )

Table('aisles', MetaData(), Column('aisle_id', Integer(), table=<aisles>), Column('aisle', String(length=100), table=<aisles>), schema=None)

In [52]:
metadata.create_all(engine)

In [ ]:
#ORM

In [55]:
aisles.to_sql("aisles", if_exists='append', con=engine, index=False)

134

In [75]:
# departments.head(2)

In [84]:
products.head(2)

,product_id,product_name,aisle_id,department_id
0,1,Chocolate Sandwich Cookies,61,19
1,10,Sparkling Orange Juice & Prickly Pear Beverage,115,7

In [92]:
# departments.head(2)
# orders.head(2)
# order_products__prior.head(2)
metadata = MetaData()
Table("products_1", metadata, 
      Column('product_id', Integer),
      Column("product_name", String(300)),
      Column("aisle_id", Integer),
      Column("department_id",Integer)
     )
metadata.create_all(engine)

In [93]:
products.to_sql("products_1", if_exists='append', con=engine, index=False)

9288

In [103]:
orders.head(2)

,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,2352815,185282,prior,5,2,9,6
1,1414622,41949,prior,9,0,16,6

In [97]:
metadata = MetaData()
Table("orders_1", metadata, 
      Column('order_id', Integer),
      Column("user_id", Integer),
      Column("eval_set", String(100)),
      Column("order_number",Integer),
      Column("order_dow",Integer),
      Column("order_hour_of_day",Integer),
      Column("days_since_prior_order",Integer)
     )
metadata.create_all(engine)

In [98]:
orders.to_sql("orders_1", if_exists='append', con=engine, index=False)

3220

In [99]:
order_products__prior.head(2)

   order_id  product_id  add_to_cart_order  reordered
0      2581       40174                  1          0
1      2581       17461                  2          0

In [100]:
metadata = MetaData()
Table("order_products__prior", metadata, 
      Column('order_id', Integer),
      Column("product_id", Integer),
      Column("add_to_cart_order", String(100)),
      Column("reordered",Integer)
     )
metadata.create_all(engine)

In [101]:
order_products__prior.to_sql("order_products__prior", if_exists='append', con=engine, index=False)

32290

In [107]:
orders.head(2)

,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,2352815,185282,prior,5,2,9,6
1,1414622,41949,prior,9,0,16,6

In [ ]:
# 
# orders table 
# 1. 주문 건수 구하기 
# 2. 구매자 수 구하기 
# 3. 상품별 주문 건수 
# - order_products__prior , products

In [ ]:
# 계정이 ?일때 password ?(백업)
# mysqldump -u? -p? db_name > ~/instacart.sql

# (복원)
# mysql -u? -p? db_name < ~/instacart.sql
# 비밀번호 변경 
# alter user '?'@'%' identified by '?';

In [106]:
products.head(2)

,product_id,product_name,aisle_id,department_id
0,1,Chocolate Sandwich Cookies,61,19
1,10,Sparkling Orange Juice & Prickly Pear Beverage,115,7

In [105]:
order_products__prior.head(2)

   order_id  product_id  add_to_cart_order  reordered
0      2581       40174                  1          0
1      2581       17461                  2          0

In [102]:
# SELECT COUNT(*) FROM orders_1
# SELECT COUNT(DISTINCT(user_id))
# FROM orders_1
# SELECT order_id, SUM(order_number)
# FROM orders_1
# GROUP BY order_id

In [112]:
import pymysql
import warnings
warnings.filterwarnings('ignore')
con =pymysql.connect(host='localhost', user='id', password='pw', db='db', charset='utf8')
cur = con.cursor()
orders_1 = pd.read_sql_query("select * from orders_1", con=con)

In [113]:
orders_1
#3220 3159유니크 61?

,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,2352815,185282,prior,5,2,9,6
1,1414622,41949,prior,9,0,16,6
2,2534064,24631,prior,66,1,13,4
3,338572,95289,prior,4,2,14,18
4,2578618,170417,prior,5,1,13,14
...,...,...,...,...,...,...,...
3215,2825511,128559,prior,2,0,17,0
3216,1472727,145051,prior,3,0,18,20
3217,800018,156428,prior,8,5,14,2
3218,2212555,71701,prior,9,5,11,17
3219,1407617,49695,prior,31,3,13,0

In [121]:
# products.head(1)
order_products__prior.head(1)

   order_id  product_id  add_to_cart_order  reordered
0      2581       40174                  1          0

In [126]:
orders_1.order_id.unique().size

3220

In [127]:
orders_1.user_id.duplicated().sum()

61

In [ ]:
# SELECT B.product_name , COUNT(DISTINCT A.order_id) cnt
# FROM order_products__prior A
# LEFT JOIN products_1 B
# ON A.product_id=B.product_id
# GROUP BY 1
# ORDER BY 2 DESC

In [129]:
order_products__prior

       order_id  product_id  add_to_cart_order  reordered
0          2581       40174                  1          0
1          2581       17461                  2          0
2          2581       19731                  3          1
3          5880       24838                  1          1
4          5880       24852                  2          1
...         ...         ...                ...        ...
32285   3420098       46676                  9          0
32286   3420098        5240                 10          0
32287   3420098       23375                 11          0
32288   3420098       42342                 12          0
32289   3420098       17706                 13          1

[32290 rows x 4 columns]

In [128]:
products

,product_id,product_name,aisle_id,department_id
0,1,Chocolate Sandwich Cookies,61,19
1,10,Sparkling Orange Juice & Prickly Pear Beverage,115,7
2,11,Peach Mango Juice,31,7
3,23,Organic Turkey Burgers,49,12
4,25,Salted Caramel Lean Protein & Fiber Bar,3,19
...,...,...,...,...
9283,49677,Thick & Chunky Sloppy Joe Sauce,59,15
9284,49678,Large Chicken & Cheese Taquitos,129,1
9285,49680,All Natural Creamy Caesar Dressing,89,13
9286,49682,California Limeade,98,7
9287,49683,Cucumber Kirby,83,4

In [130]:
"""SELECT B.product_name , COUNT(DISTINCT A.order_id) cnt
FROM order_products__prior A
LEFT JOIN products_1 B
ON A.product_id=B.product_id
GROUP BY 1
ORDER BY 2 DESC"""

'SELECT B.product_name , COUNT(DISTINCT A.order_id) cnt\nFROM order_products__prior A\nLEFT JOIN products_1 B\nON A.product_id=B.product_id\nGROUP BY 1\nORDER BY 2 DESC'

In [135]:
pd.merge(order_products__prior, \
         products, on="product_id", how="left").groupby(["product_name"])["order_id"].count().sort_values(ascending=False)

product_name
Banana                                                    486
Bag of Organic Bananas                                    387
Organic Strawberries                                      289
Organic Baby Spinach                                      235
Organic Hass Avocado                                      210
                                                         ...
1% Milkfat Low Fat Vitamin A & D Milk                       1
1.5% Milkfat Grade A Pasteurized Lowfat Cottage Cheese      1
1/3 Less Fat Chive & Onion Cream Cheese                     1
10 Grams Protein Cranberry Almond Instant Oatmeal           1
100% Baby Kale                                              1
Name: order_id, Length: 9288, dtype: int64